[
  {
    "id": "38e87a07-94ee-418e-b8e2-c8ead56684ee",
    "Title": "Unlocking Android",
    "Isbn": "9781933988672",
    "PageCount": 416,
    "Publisher": "June 7, 2009 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson.jpg",
    "Description": "Unlocking Android: A Developer's Guide provides concise, hands-on instruction for the Android operating system and development tools. This book teaches important architectural concepts in a straightforward writing style and builds on this with practical and useful examples throughout.",
    "CategoryId": 1,
    "Created": "2021-09-18 21:40:44",
    "Updated": "2020-11-07 20:35:43"
  },
  {
    "id": "1257ab66-2feb-4adc-a969-120dcfaa5799",
    "Title": "Android in Action, Second Edition",
    "Isbn": "9781935182726",
    "PageCount": 592,
    "Publisher": "14 November, 2011 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson2.jpg",
    "Description": "Android in Action, Second Edition is a comprehensive tutorial for Android developers. Taking you far beyond \"Hello Android,\" this fast-paced book puts you in the driver's seat as you learn important architectural concepts and implementation strategies. You'll master the SDK, build WebKit apps using HTML 5, and even learn to extend or replace Android's built-in features by building useful and intriguing examples. ",
    "CategoryId": 1,
    "Created": "2021-09-03 19:07:48",
    "Updated": "2021-03-05 20:07:38"
  },
  {
    "id": "4c67e3fb-e7e1-4360-878e-09b8d3027f72",
    "Title": "Specification by Example",
    "Isbn": "9781617290084",
    "PageCount": 249,
    "Publisher": "June 3, 2011 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/adzic.jpg",
    "Description": "Specification by Example is an emerging practice for creating software based on realistic examples, bridging the communication gap between business stakeholders and the dev teams building the software. In this book, author Gojko Adzic distills interviews with successful teams worldwide, sharing how they specify, develop, and deliver software, without defects, in short iterative delivery cycles.",
    "CategoryId": 1,
    "Created": "2021-09-11 05:45:32",
    "Updated": "2021-02-01 23:55:41"
  },
  {
    "id": "79b645f8-0a5b-4d5e-a0ae-5dda2324d04d",
    "Title": "Flex 3 in Action",
    "Isbn": "9781935182429",
    "PageCount": 576,
    "Publisher": "November 25, 2010 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ahmed.jpg",
    "Description": "New web applications require engaging user-friendly interfaces   and the cooler, the better. With Flex 3, web developers at any skill level can create high-quality, effective, and interactive Rich Internet Applications (RIAs) quickly and easily. Flex removes the complexity barrier from RIA development by offering sophisticated tools and a straightforward programming language so you can focus on what you want to do instead of how to do it. And now that the major components of Flex are free and open-source, the cost barrier is gone, as well!    Flex 3 in Action is an easy-to-follow, hands-on Flex tutorial. Chock-full of examples, this book goes beyond feature coverage and helps you put Flex to work in real day-to-day tasks. You'll quickly master the Flex API and learn to apply the techniques that make your Flex applications stand out from the crowd.    Interesting themes, styles, and skins  It's in there.  Working with databases  You got it.  Interactive forms and validation  You bet.  Charting techniques to help you visualize data  Bam!  The expert authors of Flex 3 in Action have one goal   to help you get down to business with Flex 3. Fast.    Many Flex books are overwhelming to new users   focusing on the complexities of the language and the super-specialized subjects in the Flex eco-system; Flex 3 in Action filters out the noise and dives into the core topics you need every day. Using numerous easy-to-understand examples, Flex 3 in Action gives you a strong foundation that you can build on as the complexity of your projects increases.",
    "CategoryId": 1,
    "Created": "2021-09-10 20:09:09",
    "Updated": "2021-06-18 03:37:19"
  },
  {
    "id": "76d38217-8e61-4a13-8a63-6cf6572af8c0",
    "Title": "Flex 4 in Action: Revised Edition of Flex 3 in Action",
    "Isbn": "1935182420",
    "PageCount": 600,
    "Publisher": "November 25, 2010 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ahmed2.jpg",
    "Description": "Using Flex, you can create high-quality, effective, and interactive Rich Internet Applications (RIAs) quickly and easily. Flex removes the complexity barrier from RIA development by offering sophisticated tools and a straightforward programming language so you can focus on what you want to do instead of how to do it. And the new features added in Flex 4 give you an even wider range of options!    Flex 4 in Action is an easy-to-follow, hands-on Flex tutorial that goes beyond feature coverage and helps you put Flex to work in real day-to-day tasks. You'll quickly master the Flex API and learn to apply the techniques that make your Flex applications stand out from the crowd.    The expert authors of Flex 4 in Action have one goal-to help you get down to business with Flex. Fast. Flex 4 in Action filters out the noise and dives into the core topics you need every day. Using numerous easy-to-understand examples, Flex 4 in Action gives you a strong foundation that you can build on as the complexity of your projects increases.    Interesting themes, styles, and skins  It's in there.  Working with databases  You got it.  Interactive forms and validation  You bet.  Charting techniques to help you visualize data  Bam!  And you'll get full coverage of these great Flex 4 upgrades:  Next generation Spark components-New buttons, form inputs, navigation controls and other visual components replace the Flex 3 \"Halo\" versions. Spark components are easier to customize, which makes skinning and theme design much faster  A new \"network monitor\" allows you to see the data communications between a Flex application and a backend server, which helps when trying to debug applications that are communicating to another system/service  Numerous productivity boosting features that speed up the process of creating applications  A faster compiler to take your human-written source code and convert it into a machine-readable format  Built-in support for unit testing allows you to improve the quality of your software, and reduce the time spent in testing",
    "CategoryId": 1,
    "Created": "2021-09-06 13:55:13",
    "Updated": "2020-12-10 06:59:33"
  },
  {
    "id": "667145c9-b666-40f9-be1b-ffd7bf61719a",
    "Title": "Collective Intelligence in Action",
    "Isbn": "9781933988313",
    "PageCount": 425,
    "Publisher": "November 7, 2008 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alag.jpg",
    "Description": "There's a great deal of wisdom in a crowd, but how do you listen to a thousand people talking at once  Identifying the wants, needs, and knowledge of internet users can be like listening to a mob.    In the Web 2.0 era, leveraging the collective power of user contributions, interactions, and feedback is the key to market dominance. A new category of powerful programming techniques lets you discover the patterns, inter-relationships, and individual profiles   the collective intelligence   locked in the data people leave behind as they surf websites, post blogs, and interact with other users.    Collective Intelligence in Action is a hands-on guidebook for implementing collective-intelligence concepts using Java. It is the first Java-based book to emphasize the underlying algorithms and technical implementation of vital data gathering and mining techniques like analyzing trends, discovering relationships, and making predictions. It provides a pragmatic approach to personalization by combining content-based analysis with collaborative approaches.    This book is for Java developers implementing collective intelligence in real, high-use applications. Following a running example in which you harvest and use information from blogs, you learn to develop software that you can embed in your own applications. The code examples are immediately reusable and give the Java developer a working collective intelligence toolkit.    Along the way, you work with, a number of APIs and open-source toolkits including text analysis and search using Lucene, web-crawling using Nutch, and applying machine learning algorithms using WEKA and the Java Data Mining (JDM) standard.",
    "CategoryId": 1,
    "Created": "2021-09-17 01:57:17",
    "Updated": "2020-12-24 09:47:41"
  },
  {
    "id": "08acae38-4ec8-4117-8017-83f52354cdf2",
    "Title": "Zend Framework in Action",
    "Isbn": "9781933988320",
    "PageCount": 432,
    "Publisher": "January 7, 2009 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/allen.jpg",
    "Description": "Zend Framework in Action is a comprehensive tutorial that shows how to use the Zend Framework to create web-based applications and web services. This book takes you on an over-the-shoulder tour of the components of the Zend Framework as you build a high quality, real-world web application.",
    "CategoryId": 1,
    "Created": "2021-09-14 12:46:03",
    "Updated": "2020-09-24 18:40:16"
  },
  {
    "id": "ded0b5ad-b565-4660-9fa0-67f88b4cb940",
    "Title": "Flex on Java",
    "Isbn": "9781933988795",
    "PageCount": 265,
    "Publisher": "November 22, 2010 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/allmon.jpg",
    "Description": "A beautifully written book that is a must have for every Java Developer. Ashish Kulkarni, Technical Director, E-Business Software Solutions Ltd.",
    "CategoryId": 1,
    "Created": "2021-09-07 02:35:49",
    "Updated": "2021-01-01 18:01:05"
  },
  {
    "id": "18bf0221-74b4-4000-8b63-2999b7512267",
    "Title": "Griffon in Action",
    "Isbn": "9781935182238",
    "PageCount": 375,
    "Publisher": "June 11, 2012 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/almiray.jpg",
    "Description": "Griffon in Action is a comprehensive tutorial written for Java developers who want a more productive approach to UI development. In this book, you'll immediately dive into Griffon. After a Griffon orientation and a quick Groovy tutorial, you'll start building examples that explore Griffon's high productivity approach to Swing development. One of the troublesome parts of Swing development is the amount of Java code that is required to get a simple application off the ground.",
    "CategoryId": 1,
    "Created": "2021-09-20 12:20:57",
    "Updated": "2020-11-19 09:23:46"
  },
  {
    "id": "ac1ceeab-805c-4a8e-8cc6-efa5a3cd1475",
    "Title": "OSGi in Depth",
    "Isbn": "9781935182177",
    "PageCount": 325,
    "Publisher": "December 24, 2011 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alves.jpg",
    "Description": "Enterprise OSGi shows a Java developer how to develop to the OSGi Service Platform Enterprise specification, an emerging Java-based technology for developing modular enterprise applications. Enterprise OSGi addresses several shortcomings of existing enterprise platforms, such as allowing the creation of better maintainable and extensible applications, and provide a simpler, easier-to-use, light-weight solution to enterprise software development.",
    "CategoryId": 1,
    "Created": "2021-09-11 19:13:18",
    "Updated": "2020-12-06 16:34:52"
  },
  {
    "id": "b1798944-e22e-42b5-bb4d-52d6fe7439b0",
    "Title": "Flexible Rails",
    "Isbn": "9781933988504",
    "PageCount": 592,
    "Publisher": "January 30, 2008 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/armstrong.jpg",
    "Description": "\"Flexible Rails created a standard to which I hold other technical books. You definitely get your money's worth.\"",
    "CategoryId": 1,
    "Created": "2021-09-12 09:46:27",
    "Updated": "2021-06-25 11:35:07"
  },
  {
    "id": "9c4366b2-5d03-4039-810e-9e5f8b15fe64",
    "Title": "Hello! Flex 4",
    "Isbn": "9781933988764",
    "PageCount": 258,
    "Publisher": "October 31, 2009 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/armstrong3.jpg",
    "Description": "Hello! Flex 4 progresses through 26 self-contained examples selected so you can progressively master Flex. They vary from small one-page apps, to a 3D rotating haiku, to a Connect Four-like game. And in the last chapter you'll learn to build a full Flex application called SocialStalkr   a mashup that lets you follow your friends by showing their tweets on a Yahoo map.",
    "CategoryId": 1,
    "Created": "2021-09-06 14:38:03",
    "Updated": "2021-02-19 09:13:24"
  },
  {
    "id": "690984d9-6005-4076-9369-03b569fbb5aa",
    "Title": "Coffeehouse",
    "Isbn": "9781884777387",
    "PageCount": 316,
    "Publisher": "August 15, 1997 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/asher.jpg",
    "Description": "Coffeehouse is an anthology of stories, poems and essays originally published on the World Wide Web.",
    "CategoryId": 1,
    "Created": "2021-09-10 12:32:02",
    "Updated": "2021-01-02 13:22:25"
  },
  {
    "id": "67940e83-be7c-4b86-a953-331c3275b2aa",
    "Title": "Team Foundation Server 2008 in Action",
    "Isbn": "9781933988597",
    "PageCount": 344,
    "Publisher": "January 7, 2009 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/azher.jpg",
    "Description": "In complex software projects, managing the development process can be as critical to success as writing the code itself. A project may involve dozens of developers, managers, architects, testers, and customers, hundreds of builds, and thousands of opportunities to get off-track. To keep tabs on the people, tasks, and components of a medium- to large-scale project, most teams use a development system that allows for easy monitoring, follow-up, and accountability.    Microsoft Team Foundation Server 2008 (TFS), the server component of Microsoft's Visual Studio Team System (VSTS), provides a powerful collaborative platform for software-development teams. The product offers an integrated toolset for tracking work items, creating test cases, managing source code, generating builds, constructing database schemas, and so on. Because in software development one size does not fit all, TFS provides process customization, project management, and reporting capabilities to build solutions around your requirements.    Team Foundation Server 2008 in Action is a hands-on guide to Team Foundation Server 2008. Written for developers with a good handle on TFS basics, this book shows you how to solve real-life problems. It's not a repetition of Microsoft's product documentation. Team Foundation Server 2008 in Action is a practitioner's handbook for how to work with TFS under common constraints. This book walks you through real-life software engineering problems based on hundreds of hours of TFS experience.    You'll benefit from expert author Jamil Azher's extensive interactions with members of Microsoft's TFS team and MVPs, survey feedback from the author's blog, and interviews with organizations and user groups using TFS. Instead of just offering a high-level overview, the book provides detailed solutions for solving common   and not-so-common   problems using TFS. It discusses the strengths as well as weaknesses of TFS, and suggests appropriate problem resolution steps, workarounds, or custom solutions.",
    "CategoryId": 1,
    "Created": "2021-09-14 11:06:40",
    "Updated": "2021-06-28 19:00:35"
  },
  {
    "id": "a13545c9-b284-4924-ae82-737982756b62",
    "Title": "Brownfield Application Development in .NET",
    "Isbn": "9781933988719",
    "PageCount": 550,
    "Publisher": "April 28, 2010 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/baley.jpg",
    "Description": "Brownfield Application Development in .Net shows you how to approach legacy applications with the state-of-the-art concepts, patterns, and tools you've learned to apply to new projects. Using an existing application as an example, this book guides you in applying the techniques and best practices you need to make it more maintainable and receptive to change.",
    "CategoryId": 1,
    "Created": "2021-09-11 13:10:09",
    "Updated": "2021-01-05 19:00:52"
  },
  {
    "id": "22816eb2-30b5-40f0-b4be-8a5396606fe1",
    "Title": "MongoDB in Action",
    "Isbn": "9781935182870",
    "PageCount": 312,
    "Publisher": "December 16, 2011 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/banker.jpg",
    "Description": "MongoDB In Action is a comprehensive guide to MongoDB for application developers. The book begins by explaining what makes MongoDB unique and describing its ideal use cases. A series of tutorials designed for MongoDB mastery then leads into detailed examples for leveraging MongoDB in e-commerce, social networking, analytics, and other common applications.",
    "CategoryId": 1,
    "Created": "2021-09-11 10:33:03",
    "Updated": "2020-12-08 19:40:48"
  },
  {
    "id": "7d08bae3-ee80-4f0e-a89d-6657abc820aa",
    "Title": "Distributed Application Development with PowerBuilder 6.0",
    "Isbn": "9781884777684",
    "PageCount": 504,
    "Publisher": "Manning Publications",
    "Description": "Distributed Application Development with PowerBuilder 6.0 is a vital source for the PowerBuilder programmer; it provides the sort of detailed coverage of Distributed PowerBuilder that you can find nowwhere else.    The book opens with a discussion of distributed computing in general, as well as its design principles and technologies. Then Distributed PowerBuilder is examined in detail. By building a simple application step by step, the author discusses all of the concepts and components needed for building a PowerBuilder application and shows how to make the application available over a network.    Finally, the author explores how PowerBuilder can be used in distributed solutions both with and without using DPB.    Distributed Application Development with PowerBuilder 6.0 is for any PowerBuilder developer looking for information on distributed computing options with the PowerBuilder environment. IS managers, system architects, and developers using many different technologies can learn how PowerBuilder can be used as all or part of the solution for building distributed applications.    The main topic of this book is Distributed PowerBuilder (DPB). It covers the basics of building a DPB application and walks through each new feature with examples including the Shared object, DataWindow synchronization, Server Push and Web.PB. It also explains distributed computing technologies and design principles so that your application can be built to handle the stresses of a distributed environment.  ",
    "CategoryId": 1,
    "Created": "2021-09-16 07:05:29",
    "Updated": "2021-04-21 17:18:13"
  },
  {
    "id": "c6555f15-d72c-489e-bd91-c2dba2f21c27",
    "Title": "Jaguar Development with PowerBuilder 7",
    "Isbn": "9781884777868",
    "PageCount": 550,
    "Publisher": "January 1, 2000 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/barlotta2.jpg",
    "Description": "Jaguar Development with PowerBuilder 7 is the definitive guide to distributed application development with PowerBuilder. It is the only book dedicated to preparing PowerBuilder developers for Jaguar applications and has been approved by Sybase engineers and product specialists who build the tools described in the book.",
    "CategoryId": 1,
    "Created": "2021-09-05 17:55:45",
    "Updated": "2021-04-09 00:18:35"
  },
  {
    "id": "4b572b04-80db-4586-9594-dcd2a08d07e1",
    "Title": "Taming Jaguar",
    "Isbn": "9781930110038",
    "PageCount": 362,
    "Publisher": "January 1, 2000 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/barlotta3.jpg",
    "Description": "Taming Jaguar is part of the PowerBuilder Developer's series, which includes Distributed Application Development with PowerBuilder 6 and Jaguar Development with PowerBuilder 7.    An application server is the heart of your enterprise computing architecture, centralizing your web content, business logic, and access to your data and legacy applications. Sybase's application server, Jaguar CTS, delivers performance, scalability, and flexibility running CORBA , COM, Java/EJB, C++, and PowerBuilder components.    If you are looking to adopt Jaguar in your enterprise, look no further. Taming Jaguar shows you how to solve the real-world problems of installing, trouble-shooting, designing, developing, and maintaining a Jaguar application. Topical chapters are organized in a Q & A format making it easy for you to quickly find the solution to your problem. They also provide foundational and background information as well as detailed technical how-tos.    Although designed so you can find your problems easily, this book is meant to be read cover-to-cover with each chapter discussing its topic exhaustively.    What's inside:    J2EE development  Java Servlets  Jaguar administration & code balancing  EJBs  Web development with PowerDynamo  Advanced component design ",
    "CategoryId": 1,
    "Created": "2021-09-10 15:51:33",
    "Updated": "2021-06-01 14:39:05"
  },
  {
    "id": "dae1bd60-88c8-4c9c-b6a2-bbc3658653cc",
    "Title": "3D User Interfaces with Java 3D",
    "Isbn": "9781884777905",
    "PageCount": 520,
    "Publisher": "August 1, 2000 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/barrilleaux.jpg",
    "Description": "3D User Interfaces with Java 3D is a practical guide for providing next-generation applications with 3D user interfaces for manipulation of in-scene objects. Emphasis is on standalone and web-based business applications, such as for online sales and mass customization, but much of what this book offers has broad applicability to 3D user interfaces in other pursuits such as scientific visualization and gaming.  This book provides an extensive conceptual framework for 3D user interface techniques, and an in-depth introduction to user interface support in the Java 3D API, including such topics as picking, collision, and drag-and-drop. Many of the techniques are demonstrated in a Java 3D software framework included with the book, which also provides developers with many general-purpose building blocks for constructing their own user interfaces.    Applications and their use of 3D are approached realistically. The book is geared towards sophisticated user interfaces for the \"everyday user\" who doesn't have a lot of time to learn another application--much less a complicated one--and an everyday computer system without exotic devices like head mounted displays and data gloves. Perhaps the best description of this book is: \"A roadmap from Java 3D to 'Swing 3D'.\"",
    "CategoryId": 1,
    "Created": "2021-09-03 02:18:45",
    "Updated": "2021-05-27 07:13:32"
  },
  {
    "id": "c710a599-9a00-42aa-a575-568eb75a309a",
    "Title": "Hibernate in Action",
    "Isbn": "9781932394153",
    "PageCount": 400,
    "Publisher": "August 1, 2004 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer.jpg",
    "Description": "\"2005 Best Java Book!\" -- Java Developer's Journal",
    "CategoryId": 1,
    "Created": "2021-09-11 05:38:17",
    "Updated": "2021-08-09 08:50:25"
  },
  {
    "id": "7f9c69d6-a37b-44c4-b90d-31ac6e349fdd",
    "Title": "Java Persistence with Hibernate: Revised Edition of Hibernate in Action",
    "Isbn": "9781932394887",
    "PageCount": 400,
    "Publisher": "December 1, 2006 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer-cn.jpg",
    "Description": "Persistence-the ability of data to outlive an instance of a program-is central to modern applications. Hibernate, the most popular Java persistence tool, provides automatic and transparent object/relational mapping making it a snap to work with SQL databases in Java applications. Hibernate applications are cheaper, more portable, and more resilient to change. Because it conforms to the new EJB 3.0 and Java Persistence 1.0 standard, Hibernate allows the developer to seamlessly create efficient, scalable Java EE applications.",
    "CategoryId": 1,
    "Created": "2021-09-18 20:47:30",
    "Updated": "2021-05-23 20:03:31"
  },
  {
    "id": "06a45eac-dd38-4657-a3e2-273d80e903f7",
    "Title": "Java Persistence with Hibernate",
    "Isbn": "9781638355229",
    "PageCount": 880,
    "Publisher": "October 27, 2015 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer2.jpg",
    "Description": "\"...this book is the ultimate solution. If you are going to use Hibernate in your application, you have no other choice, go rush to the store and get this book.\" --JavaLobby",
    "CategoryId": 1,
    "Created": "2021-09-11 10:44:55",
    "Updated": "2021-01-04 17:12:58"
  },
  {
    "id": "6358a750-d514-4255-8859-9e4da42735f4",
    "Title": "JSTL in Action",
    "Isbn": "9781930110526",
    "PageCount": 480,
    "Publisher": "July 1, 2002 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bayern.jpg",
    "Description": "JSTL is an important simplification of the Java web platform. With JSTL, page authors can now write dynamic pages using standard HTML-like tags and an easy-to-learn expression language. JSTL is a standard from the Java Community Process, and its expression language will become part of JSP 2.0.    JSTL in Action shows you how to write rich, dynamic web pages without programming. From simple loops to tricky XML processing, every feature of JSTL is covered and exercised in numerous useful examples. Whether you are a novice page author or an experienced Java programmer, this book shows you easy ways to create powerful web sites.    To help readers who don't already have a JSP container run the examples in the book, there's a free companion download here. This bundle contains a ready-to-run JSP container, a JSTL implementation, and all the book's examples.",
    "CategoryId": 1,
    "Created": "2021-09-07 06:13:04",
    "Updated": "2020-09-28 16:57:46"
  },
  {
    "id": "903b5b80-cedd-4b84-938c-6bda100b955b",
    "Title": "iBATIS in Action",
    "Isbn": "9781932394825",
    "PageCount": 384,
    "Publisher": "January 27, 2007 by Manning",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/begin.jpg",
    "Description": "   Gets new users going and gives experienced users in-depth coverage of advanced features.       Jeff Cunningham, The Weather Channel Interactive",
    "CategoryId": 1,
    "Created": "2021-09-03 20:25:43",
    "Updated": "2021-01-03 14:54:54"
  },
  {
    "id": "2fb3e1c8-3463-4dd4-a33f-30c1d00d7e26",
    "Title": "Designing Hard Software",
    "Isbn": "9780133046199",
    "PageCount": 350,
    "Publisher": "December 1, 1996 by Prentice Hall",
    "Description": "\"This book is well written ... The author does not fear to be controversial. In doing so, he writes a coherent book.\" --Dr. Frank J. van der Linden, Phillips Research Laboratories",
    "CategoryId": 1,
    "Created": "2021-09-15 22:06:25",
    "Updated": "2021-06-04 22:14:26"
  },
  {
    "id": "164276e1-edc5-438b-bbf0-c8a7113a168c",
    "Title": "Hibernate Search in Action",
    "Isbn": "9781933988641",
    "PageCount": 488,
    "Publisher": "First published December 28, 2008",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bernard.jpg",
    "Description": "\"A great resource for true database independent full text search.\" --Aaron Walker, base2Services",
    "CategoryId": 1,
    "Created": "2021-09-17 13:52:44",
    "Updated": "2021-02-10 19:23:57"
  },
  {
    "id": "17eb64d6-50cd-49d1-91bf-7474d856380e",
    "Title": "jQuery in Action",
    "Isbn": "9781933988351",
    "PageCount": 376,
    "Publisher": "First published February 7, 2008",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bibeault.jpg",
    "Description": "\"The best-thought-out and researched piece of literature on the jQuery library.\" --From the forward by John Resig, Creator of jQuery",
    "CategoryId": 1,
    "Created": "2021-09-15 12:23:36",
    "Updated": "2020-12-02 16:23:55"
  },
  {
    "id": "e33f56a7-3be1-4c74-9c89-aa7ed9e0aa22",
    "Title": "jQuery in Action, Second Edition",
    "Isbn": "9781935182320",
    "PageCount": 488,
    "Publisher": "May 20, 2010 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bibeault2.jpg",
    "Description": "jQuery in Action, Second Edition is a fast-paced introduction to jQuery that will take your JavaScript programming to the next level. An in-depth rewrite of the bestselling first edition, this edition provides deep and practical coverage of the latest jQuery and jQuery UI releases. The book's unique \"lab pages\" anchor the explanation of each new concept in a practical example. You'll learn how to traverse HTML documents, handle events, perform animations, and add Ajax to your web pages. This comprehensive guide also teaches you how jQuery interacts with other tools and frameworks and how to build jQuery plugins. ",
    "CategoryId": 1,
    "Created": "2021-09-18 14:57:34",
    "Updated": "2021-06-05 22:11:07"
  },
  {
    "id": "eb9a489c-a1c9-4ef8-92ab-3ed805ec810c",
    "Title": "Building Secure and Reliable Network Applications",
    "Isbn": "9780137195848",
    "PageCount": 591,
    "Publisher": "October 1, 1996 by Prentice Hall",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/birman.jpg",
    "Description": "\"... tackles the difficult problem of building reliable distributed computing systems in a way that not only presents the principles but also describes proven practical solutions.\" --John Warne, BNR Europe",
    "CategoryId": 1,
    "Created": "2021-09-18 13:38:11",
    "Updated": "2021-04-26 11:06:09"
  },
  {
    "id": "2f8663c0-495f-4a1b-b36a-a01bd72b147f",
    "Title": "Ruby for Rails",
    "Isbn": "9781932394696",
    "PageCount": 532,
    "Publisher": "May 11, 2006 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black.jpg",
    "Description": "The word is out: with Ruby on Rails you can build powerful Web applications easily and quickly! And just like the Rails framework itself, Rails applications are Ruby programs. That means you can   t tap into the full power of Rails unless you master the Ruby language.",
    "CategoryId": 1,
    "Created": "2021-09-19 20:57:43",
    "Updated": "2021-08-25 00:03:37"
  },
  {
    "id": "cec58183-30ec-4826-a054-b5b5858c91cc",
    "Title": "The Well-Grounded Rubyist",
    "Isbn": "9781933988658",
    "PageCount": 520,
    "Publisher": "June 4, 2009 by Manning Publications",
    "CoverUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black2.jpg",
    "Description": "What would appear to be the most complex topic of the book is in fact surprisingly easy to assimilate, and one realizes that the efforts of the author to gradually lead us to a sufficient knowledge of Ruby in order to tackle without pain the most difficult subjects, bears its fruit.       Eric Grimois, Developpez.com",
    "CategoryId": 1,
    "Created": "2021-09-02 13:30:01",
    "Updated": "2020-12-18 02:59:58"
  }
]